# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [22, 22, 46, 46, 199, 190]  # P3/8

# backbone -- pytorch resnet-18
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [128, 7, 2, 3]],  # 0-P1/2
   [-1, 1, MaxPool2d, [3, 2, 1]],  
   # layer1
   [-1, 1, Layer, [128, 2]], # 2-P2/4
   # layer2
   [-1, 1, Layer, [256, 2, 2]], # 3-P3/8
   # layer3
   [-1, 1, Layer, [512, 2, 2]], # 4-P4/16
   # layer4
   [-1, 1, Layer, [1024, 2, 2]], # 5-P5/32
   [-1, 1, SPPF, [1024, 5]],  # 6
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'bilinear', True]],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 10

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'bilinear', True]],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 14 (P3/8-small)

   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'bilinear', True]],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P2
   [-1, 3, C3, [128, False]],  # 18

   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'bilinear', True]],
   [[-1, 0], 1, Concat, [1]],  # cat backbone P1
   [-1, 3, C3, [128, False]],  # 22

   [-1, 1, nn.Upsample, [None, 2, 'bilinear', True]],
   [[14, 23], 1, SegDetect, [nc, anchors]],
  ]
